SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( #5BEL_2051_89
	Type ( Engine )
	WagonShape ( 5BEL_2051_89.s )
 	
	Size  ( 2.86512m 4.13972m 21.1105m )
	CentreOfGravity ( 0.0m 0.0m 0.05m )
	Mass ( 90.7t )
	WheelRadius ( 0.5m )
	InertiaTensor ( Box ( 2.86512m 4.13972m 20.9105m ) )
	Coupling (
		Type ( Chain )
		Spring (
			Stiffness ( 1e5N/m 5e5N/m )
			Damping ( 1.2e5N/m/s 3.3e5N/m/s )
			Break ( 2.5e8N 2.5e8N )
			r0 ( 2cm 7cm )
		)
		Velocity ( 0.1m/s )
	)
	Buffers (
		Spring (
			Stiffness ( 1e7N/m 5e7N/m )
			Damping ( 1.2e7N/m/s 3.3e7N/m/s )
			r0 ( 0m 1e9 )
		)
		Centre ( 0.5 )
		Radius ( 1 )
		Angle ( 0.5deg )
	)

	comment( guessed brake force )
	MaxBrakeForce ( 150kN )
	Adheasion ( 0.2 0.4 2 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 230kN )
	DerailBufferForce ( 200kN )
	NumWheels ( 8 )
	Friction (
		650N/m/s		1		-1mph		0		1
		5.1N/rad/s		1		-1rad/s		0		1
	)
	AntiSlip ()
	
	BrakeEquipmentType( "Air_twin_pipe, Distributor" )

	BrakeSystemType( "Air_twin_pipe" )
	
	MaxBrakeForce( 180kN )

	EmergencyBrakeResMaxPressure( 110 )
	TripleValveRatio( 2.5 )
	MaxReleaseRate( 20 )
	MaxApplicationRate( 20 )
	MaxAuxilaryChargingRate( 30 )
	EmergencyResCapacity( 10 )
	EmergencyResChargingRate( 30 )
	BrakeCylinderPressureForMaxBrakeBrakeForce( 70 )

	BrakeDistributorFullServicePressure( 82 )
	BrakeDistributorMaxAuxilaryResPressure( 110 )
	BrakeDistributorEmergencyResPressure( 110 )
	BrakeDistributorReleaseRate( 10 )
	BrakeDistributorApplicationRate( 15 )
	BrakeDistributorTrainPipeControlRatio( 2.03 )
	BrakeDistributorNormalFullReleasePressure( 110 )

        Lights	(	4
                 Light ( 
                        comment( Pickups ) 
                        Type       ( 0 ) 
                        Conditions ( 
                                Headlight ( 0 ) 
                                Service ( 2 ) 
                                Unit ( 0 ) 
                                ) 
                        FadeIn ( 0.5 ) 
                        FadeOut ( 0.5 ) 
                        Cycle ( 0 ) 
                        States ( 4 
                               State ( 
                                     Duration ( 0.1 ) 
                                     LightColour ( 8000ccff ) 
                                     Position ( 1.11343 0.11369 7 ) 
                                     Azimuth ( 30 30 30 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 )
                                     ) 
                               State ( 
                                     Duration ( 0.1 ) 
                                     LightColour ( 80000000 ) 
                                     Position ( 1.11343 0.11369 7 ) 
                                     Azimuth ( 30 30 30 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                               State ( 
                                     Duration ( 0.1 ) 
                                     LightColour ( 8000ccff ) 
                                     Position ( 1.11343 0.11369 7 ) 
                                     Azimuth ( 30 30 30 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                               State ( 
                                     Duration ( 10 ) 
                                     LightColour ( 80000000 ) 
                                     Position ( 1.11343 0.11369 7 ) 
                                     Azimuth ( 30 30 30 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                              )
                           )
                     Light ( 
                        comment( Pickups ) 
                        Type       ( 0 ) 
                        Conditions ( 
                                Headlight ( 0 ) 
                                Service ( 2 ) 
                                Unit ( 0 ) 
                                ) 
                        FadeIn ( 0.5 ) 
                        FadeOut ( 0.5 ) 
                        Cycle ( 0 ) 
                        States ( 4 
                               State ( 
                                     Duration ( 0.2 ) 
                                     LightColour ( 8000ccff ) 
                                     Position ( -1.11343 0.11369 7 ) 
                                     Azimuth ( -30 -30 -30 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 )
                                     ) 
                               State ( 
                                     Duration ( 0.1 ) 
                                     LightColour ( 80000000 ) 
                                     Position ( -1.11343 0.11369 7 ) 
                                     Azimuth ( -30 -30 -30 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                               State ( 
                                     Duration ( 0.2 ) 
                                     LightColour ( 8000ccff ) 
                                     Position ( -1.11343 0.11369 7 ) 
                                     Azimuth ( -30 -30 -30 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                               State ( 
                                     Duration ( 10 ) 
                                     LightColour ( 80000000 ) 
                                     Position ( -1.11343 0.11369 7 ) 
                                     Azimuth ( -30 -30 -30 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                              )
                           )
                     Light ( 
                        comment( Pickups ) 
                        Type       ( 0 ) 
                        Conditions ( 
                                Headlight ( 0 ) 
                                Service ( 2 ) 
                                Unit ( 0 ) 
                                ) 
                        FadeIn ( 0.5 ) 
                        FadeOut ( 0.5 ) 
                        Cycle ( 0 ) 
                        States ( 4 
                               State ( 
                                     Duration ( 0.3 ) 
                                     LightColour ( 8000ccff ) 
                                     Position ( -1.11343 0.1 -7 ) 
                                     Azimuth ( -150 -150 -150 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 )
                                     ) 
                               State ( 
                                     Duration ( 0.4 ) 
                                     LightColour ( 80000000 ) 
                                     Position ( -1.11343 0.1 -7 ) 
                                     Azimuth ( -150 -150 -150 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                               State ( 
                                     Duration ( 0.3 ) 
                                     LightColour ( 8000ccff ) 
                                     Position ( -1.11343 0.1 -7 ) 
                                     Azimuth ( -150 -150 -150 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                               State ( 
                                     Duration ( 10 ) 
                                     LightColour ( 80000000 ) 
                                     Position ( -1.11343 0.1 -7 ) 
                                     Azimuth ( -150 -150 -150 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                              )
                           ) 
                    Light ( 
                        comment( Pickups ) 
                        Type       ( 0 ) 
                        Conditions ( 
                                Headlight ( 0 ) 
                                Service ( 2 ) 
                                Unit ( 0 ) 
                                ) 
                        FadeIn ( 0.5 ) 
                        FadeOut ( 0.5 ) 
                        Cycle ( 0 ) 
                        States ( 4 
                               State ( 
                                     Duration ( 0.3 ) 
                                     LightColour ( 8000ccff ) 
                                     Position ( 1.11343 0.1 -7 ) 
                                     Azimuth ( 150 150 150 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 )
                                     ) 
                               State ( 
                                     Duration ( 0.3 ) 
                                     LightColour ( 80000000 ) 
                                     Position ( 1.11343 0.1 -7 ) 
                                     Azimuth ( 150 150 150 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                               State ( 
                                     Duration ( 0.3 ) 
                                     LightColour ( 8000ccff ) 
                                     Position ( 1.11343 0.1 -7 ) 
                                     Azimuth ( 150 150 150 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                               State ( 
                                     Duration ( 10 ) 
                                     LightColour ( 80000000 ) 
                                     Position ( 1.11343 0.1 -7 ) 
                                     Azimuth ( 150 150 150 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                              )
                           )   
                    )
          Sound ( "..\\..\\Common.Sound\\5Bel\\MSeng.sms" )
)

Engine ( #5BEL_2051_89
    Wagon ( #5BEL_2051_89 )
    Type ( Electric )
    MaxPower ( 1475kW )
    MaxForce ( 179kN#est )
    MaxContinuousForce ( 128kN )
    MaxVelocity ( 78mph )
    MaxCurrent ( 1600A )
    WheelRadius ( 0.5m )
    Sanding ( 1e9mph )
    NumWheels ( 1 )

    AirBrakesAirCompressorPowerRating( 3.5 )
    AirBrakesMainMinResAirPressure( 0 )
    AirBrakesMainMaxAirPressure( 140 )
    AirBrakesMainResVolume( 10 )
    AirBrakesAirCompressorWattage( 19000 )
    AirBrakesCompressorRestartPressure( 130 )
    AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.5 )
    AirBrakesHasLowPressureTest( 1 )
    AirBrakesIsCompressorElectricOrMechanical( 1 )

    EngineBrakesControllerHasProportionalBrake( 1 )
    EngineBrakesProportionalBrakeLag( 1 )

    TrainBrakesControllerMinPressureReduction( 6 )
    TrainBrakesControllerMaxApplicationRate( 10 )
    TrainBrakesControllerMaxReleaseRate( 2 )
    TrainBrakesControllerEmergencyApplicationRate( 40 )
    TrainBrakesControllerMinSystemPressure( 0 )
    TrainBrakesControllerMaxSystemPressure( 110 )
    TrainBrakesControllerEmergencyBrakeTimePenalty( 60 )
    TrainBrakesControllerFullServicePressureDrop( 26 )

    DynamicBrakesMinUsableSpeed( 5 )
    DynamicBrakesMaximumEffectiveSpeed( 25 )
    DynamicBrakesMaximumForce( 20000 )
    DynamicBrakesResistorCurrentLimit ( 5000 )
    DynamicBrakesCutInSpeed( 8 )
    DynamicBrakesMaxAirBrakePressure ( 15 )
    DynamicBrakesFadingSpeed( 25 )
    DynamicBrakesDelayTimeBeforeEngaging ( 10 )
    DynamicBrakesMaximumSpeedForFadeOut ( 65 )
    DynamicBrakesEffectAtMaximumFadeOut( 0 )
    DynamicBrakesHigherSpeedCurveExponent( 1 )
    DynamicBrakesLowerSpeedCurveExponent( 1 )
    DynamicBrakesNumberOfControllerNotches( 8 )

    BrakesEngineBrakeType( "Air_twin_pipe"  )
    BrakesTrainBrakeType( "Air_twin_pipe" )
    BrakesEngineControllers( "Train, Dynamic, Blended" )
    
    DoesBrakeCutPower( 1 )
    DoesHornTriggerBell( 1 )
    BrakeCutsPowerAtBrakeCylinderPressure( 15 )
    
	EmergencyStopMonitor(
		MonitoringDeviceMonitorTimeLimit( 0 )
		MonitoringDeviceAlarmTimeLimit( 0 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 1 )
		MonitoringDeviceAppliesCutsPower( 1 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
	)

	VigilanceMonitor(
		MonitoringDeviceMonitorTimeLimit( 45 )
		MonitoringDeviceAlarmTimeLimit( 37 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 1 )
		MonitoringDeviceAppliesEmergencyBrake( 0 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
	)

	OverspeedMonitor(
		MonitoringDeviceMonitorTimeLimit( 0 )
		MonitoringDeviceAlarmTimeLimit( 5 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 151 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 1 )
		MonitoringDeviceAppliesEmergencyBrake( 1 )
		MonitoringDeviceAppliesCutsPower( 1 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		MonitoringDeviceTriggerOnTrackOverspeed( 1 )
		MonitoringDeviceTriggerOnTrackOverspeedMargin( 2 )
		MonitoringDeviceResetOnZeroSpeed( 1 ) 
		MonitoringDeviceResetOnResetButton( 0 )
	)

    Name ( "#5BEL_2051_89_AI" )
    Description (
 	"5BEL unit 2051 car 89"

    )
    EngineOperatingProcedures (
    "To move forward\n"+
    "1. The pantograph has been raised for you. (If it is not up for some reason, press the P key to raise it.)\n"+
    "2.	Press the W key to move the Reverser to Forward.\n"+
    "3.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
    "4.	Press the D key to move increase the throttle setting.\n\n"+  
    "To slow the train\n"+
    "1.	Press the A key to move the throttle to a lower setting.\n"+
    "2.	Use the brakes to further reduce speed if desired.\n\n"+   
    "To apply the train brakes\n"+
    "1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
    "To release the train brakes\n"+
    "1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
    "To activate emergency braking\n"+
    "1.	Press the A key to reduce the throttle to Idle.\n"+
    "2.	Press the BACKSPACE key to activate emergency braking.\n\n"+
    "To back up\n"+
    "1.	Bring your train to a full stop.\n"+
    "2.	Press the S key to move the Reverser to the Reverse position.\n"+
    "3.	Press the ; (SEMICOLON)  to release the brakes.\n"+
    "4.	Slowly advance the throttle lever (D key).\n\n"+
    "To load and unload passengers\n"+
    "1. Stop at a station.\n"+
    "2. Press the ENTER key.\n"+
    "3. Wait for the 'permission to depart' signal.\n"+
    "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading."
    ) 
    
    EngineControllers (
        Throttle ( 0 1 0.025 0
            NumNotches ( 0 )
        )
        Brake_Train ( 0 1 0.0125 0.5 
            NumNotches ( 6
                Notch ( 0       0 TrainBrakesControllerReleaseStart )
                Notch ( 0.2	0 TrainBrakesControllerHoldLappedStart )
                Notch ( 0.25    1 TrainBrakesControllerGraduatedSelfLapLimitedHoldingStart )
                Notch ( 0.85    0 TrainBrakesControllerSuppressionStart )
                Notch ( 0.9     0 TrainBrakesControllerContinuousServiceStart )
                Notch ( 0.95    0 TrainBrakesControllerEmergencyStart )
            )
        )
        Brake_Dynamic ( 0 1 0.0125 0 
            NumNotches( 0 )
        )
        DirControl ( -1 0 1 1 )
        EmergencyStopResetToggle( 0 1 0 )
        EmergencyStopToggle( 0 1 0 )
        AWS ( 0 1 0 )
        Sanding ( 0 1 0 )
        Horn ( 0 1 0 )
        Vigilance ( 0 1 0 )
        PantographToggle1 ( 0 1 1 )
        Headlights ( 0 0.25 1 0 )
        Wipers ( 0 1 0 )
        BellToggle( 0 1 0 )
    )
)
